Terraform plan in __.__
With var files: `testing.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_droplet.dills_server_1 will be created
  + resource "digitalocean_droplet" "dills_server_1" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "docker-20-04"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "dills-server-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "nyc3"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + ssh_keys             = [
          + "fingerprint",
        ]
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "9ba85045ca0babe1fec278f6b63a431043449175"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_volume.dills_volume_1 will be created
  + resource "digitalocean_volume" "dills_volume_1" {
      + description             = "dills volume 1"
      + droplet_ids             = (known after apply)
      + filesystem_label        = (known after apply)
      + filesystem_type         = (known after apply)
      + id                      = (known after apply)
      + initial_filesystem_type = "ext4"
      + name                    = "dills-volume-1"
      + region                  = "nyc3"
      + size                    = 5
      + urn                     = (known after apply)
    }

  # digitalocean_volume_attachment.dills_volume_1 will be created
  + resource "digitalocean_volume_attachment" "dills_volume_1" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + volume_id  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip_server = (known after apply)
```
</details>

:memo: Plan generated in [PR Plan #38](https://github.com/dills122/do-terraform-docker/actions/runs/1767936154)